<?php

// п©Б∙╔п©Б∙÷п©Б∙╒п©Б∙÷п©Б∙╒п©Б∙╕п©Б∙╙ п©Б∙╕п©Б∙╙я▐Б√░ п©Б∙╗я▐Б■░п©Б∙╗п©Б∙╕ п©Б∙╒п©Б∙╘я▐Б√░ я▐Б■┌п©Б∙╛я▐Б■≤я▐Б■─п©Б∙÷п©Б∙╚п©Б∙ёп©Б∙╚п©Б∙╕я▐Б√░ п©Б∙║ п©Б∙╚п©Б∙ёп©Б∙╖ п©Б∙╗п©Б∙╛п©Б∙╒п©Б∙÷ п©Б∙╗п©Б∙÷п©б╘я▐Б■╓п©Б∙╕
define('CAPTCHA_COOKIE', 'imgcaptcha_');

/*

	п©Б┴╓п©Б∙╚п©Б∙╕я▐Б■°п©Б∙╕п©Б∙÷п©Б∙╘п©Б∙╕п©Б∙╔п©Б∙╕я▐Б■─я▐Б■░п©Б∙ёп©Б∙╙ п©п│п©Б∙ёп©Б∙╚п©Б∙ёя▐Б■─п©Б∙÷я▐Б■▄п©Б∙╛я▐Б■─ я▐Б■┌п©Б∙╘я▐Б■░я▐Б■╓п©Б∙÷п©Б∙╖п©Б∙╚я▐Б√─я▐Б■≤ я▐Б■╓п©Б∙╕я▐Б■┌п©Б∙ёп©Б∙╘.
	п©Б∙■п©Б∙╛я▐Б■▄я▐Б√░ п©Б∙║ я▐Б■─я▐Б■░п©Б∙╗п©Б∙╛п©Б∙║п©Б∙╛п©Б∙╒я▐Б■┌я▐Б■▄п©Б∙║п©Б∙ё п©б╘п©Б∙╛ PHP п©Б∙╚п©Б∙÷п©б╘п©Б∙╕я▐Б■┌п©Б∙÷п©Б∙╚п©Б∙╛, я▐Б■╓я▐Б■▄п©Б∙╛ я▐Б√┬я▐Б■▄п©Б∙╛ п©Б∙╒п©Б∙ёп©Б∙╘п©Б∙÷п©Б∙ёя▐Б■▄я▐Б■┌я▐Б√░ п©Б∙÷п©Б∙║я▐Б■▄п©Б∙╛п©Б∙╙п©Б∙÷я▐Б■▄п©Б∙╕я▐Б■╓п©Б∙ёя▐Б■┌п©Б∙╗п©Б∙╕
	п©Б∙╗п©Б∙÷п©Б∙╓п©Б∙╒я▐Б√─п©Б∙╖ я▐Б■─п©Б∙÷п©Б∙╔ п©б╘я▐Б■─п©Б∙╕ п©Б∙╔п©Б∙÷п©б╘я▐Б■░я▐Б■┌п©Б∙╗п©Б∙ё я▐Б■┌я▐Б■°п©Б∙ёп©Б∙╚п©Б∙÷я▐Б■─п©Б∙╕я▐Б√░, п©Б∙╚п©Б∙╛... я▐Б√░ п©Б∙╕п©Б∙╙ п©Б∙╚п©Б∙ё п©Б∙║п©Б∙ёя▐Б■─я▐Б√▄ 0_0
	
*/

mt_srand(time());

/*

	п©б╥п©б╘я▐Б■─п©Б∙ёп©Б∙╒п©Б∙ёп©Б∙╘п©Б∙╕п©Б∙╙ п©б╘я▐Б■░я▐Б■▄я▐Б√└ п©Б∙╗ п©б╘п©Б∙÷п©б╘п©Б∙╗п©Б∙ё я▐Б■┌п©Б∙╛ я▐Б■╛я▐Б■─п©Б∙╕я▐Б■■я▐Б■▄п©Б∙÷п©Б∙╙п©Б∙╕
	п©Б∙╕ я▐Б■┌п©б╘п©Б∙╕я▐Б■┌п©Б∙╛п©Б∙╗ п©Б∙╕п©Б∙╙п©Б∙ёп©Б∙╚ я▐Б■■п©Б∙÷п©Б∙╖п©Б∙╘п©Б∙╛п©Б∙║ я▐Б■┌п©Б∙╛ я▐Б■╛я▐Б■─п©Б∙╕я▐Б■■я▐Б■▄п©Б∙÷п©Б∙╙п©Б∙╕ п©Б∙║ п©Б∙╚п©Б∙ёп©Б∙╖ -
	п©Б∙╕п©Б∙╔ я▐Б√┬я▐Б■▄п©Б∙╛п©п│п©Б∙╛ я▐Б■┌п©б╘п©Б∙╕я▐Б■┌п©Б∙╗п©Б∙÷ п©Б∙╗п©Б∙÷п©Б∙╓п©Б∙╒я▐Б√─п©Б∙╖ я▐Б■─п©Б∙÷п©Б∙╔ п©Б∙═я▐Б■░п©Б∙╒п©Б∙ёп©Б∙╙ п©Б∙║я▐Б√─п©Б∙═п©Б∙╕я▐Б■─п©Б∙÷я▐Б■▄я▐Б√└ я▐Б■┌п©Б∙╘я▐Б■░я▐Б■╓п©Б∙÷п©Б∙╖п©Б∙╚я▐Б√─п©Б∙╖ я▐Б■╛я▐Б■─п©Б∙╕я▐Б■■я▐Б■▄

*/

define('PATH_TTF', 'fonts/');
$fonts = array('liber-mono.ttf', 'liber-sans.ttf');

/*

	п©б╥я▐Б■┌п©Б∙╚п©Б∙╛п©Б∙║п©Б∙╚я▐Б√─п©Б∙ё п©б╘п©Б∙÷я▐Б■─п©Б∙÷п©Б∙╙п©Б∙ёя▐Б■▄я▐Б■─я▐Б√─ п©Б∙╗п©Б∙÷п©б╘я▐Б■╓п©Б∙╕.
	
	п©Б√═п©Б∙╘я▐Б√░ п©б╘п©Б∙╛п©Б∙╒п©Б∙╒п©Б∙ёя▐Б■─п©Б∙╓п©Б∙╗п©Б∙╕ я▐Б■─п©Б∙÷п©Б∙╔п©Б∙╚я▐Б√─я▐Б■≤ п©б╘п©Б∙÷я▐Б■─п©Б∙÷п©Б∙╙п©Б∙ёя▐Б■▄я▐Б■─п©Б∙╛п©Б∙║ п©Б∙╗п©Б∙÷п©б╘я▐Б■╓п©Б∙╕ п©Б∙╔п©Б∙╒п©Б∙ёя▐Б■┌я▐Б√└ п©Б∙╙п©Б∙╛п©Б∙╓п©Б∙╚п©Б∙╛	я▐Б■┌п©Б∙╛п©Б∙╔п©Б∙╒п©Б∙÷я▐Б■▄я▐Б√└
	п©Б∙╙п©Б∙╚п©Б∙╛п©п│п©Б∙╛п©Б∙╙п©Б∙ёя▐Б■─п©Б∙╚я▐Б√─п©Б∙╖ п©Б∙╙п©Б∙÷я▐Б■┌я▐Б■┌п©Б∙╕п©Б∙║ п©Б∙╕ п©Б∙╛п©Б∙═я▐Б■─п©Б∙÷я▐Б■╢п©Б∙÷я▐Б■▄я▐Б√└я▐Б■┌я▐Б√░ п©Б∙╗ п©Б∙╚п©Б∙ёп©Б∙╙я▐Б■░ п©б╘п©Б∙╛ п©Б∙╕п©Б∙╚п©Б∙╒п©Б∙ёп©Б∙╗я▐Б■┌я▐Б■░.

*/

$par = array(
	// я▐Б■╛п©Б∙╕я▐Б■─п©Б∙╕п©Б∙╚п©Б∙÷ п©Б∙╗п©Б∙÷п©б╘я▐Б■╓п©Б∙╕
	'WIDTH' => 120,
	// п©Б∙║я▐Б√─я▐Б■┌п©Б∙╛я▐Б■▄п©Б∙÷ п©Б∙╗п©Б∙÷п©б╘я▐Б■╓п©Б∙╕
	'HEIGHT' => 32,
	// я▐Б■─п©Б∙÷п©Б∙╔п©Б∙╙п©Б∙ёя▐Б■─ я▐Б■╛я▐Б■─п©Б∙╕я▐Б■■я▐Б■▄п©Б∙÷ п©Б∙╚п©Б∙÷ п©Б∙╗п©Б∙÷п©б╘я▐Б■╓п©Б∙ё
	'FONT_SIZE' => 14,

	// п©Б∙╗п©Б∙╛п©Б∙╘-п©Б∙║п©Б∙╛ я▐Б■┌п©Б∙╕п©Б∙╙п©Б∙║п©Б∙╛п©Б∙╘п©Б∙╛п©Б∙║ п©Б∙╚п©Б∙÷ п©Б∙╗п©Б∙÷п©б╘я▐Б■╓п©Б∙ё
	'CHARS_COUNT' => 5,
	// я▐Б■─п©Б∙÷п©Б∙╔я▐Б■─п©Б∙ёя▐Б■╛п©Б∙ёп©Б∙╚п©Б∙╚я▐Б√─п©Б∙ё я▐Б■┌п©Б∙╕п©Б∙╙п©Б∙║п©Б∙╛п©Б∙╘я▐Б√─ п©Б∙╗п©Б∙÷п©б╘я▐Б■╓п©Б∙╕
	'ALLOWED_CHARS' => 'ABCDEFGHJKLMNPQRSTUVWXYZ23458',

	// я▐Б■■п©Б∙╛п©Б∙╚п©Б∙╛п©Б∙║я▐Б√─п©Б∙╖ я▐Б■°п©Б∙║п©Б∙ёя▐Б■▄ п©Б∙╗п©Б∙÷п©б╘я▐Б■╓п©Б∙╕ - п©Б∙═п©Б∙ёп©Б∙╘я▐Б√─п©Б∙╖ п©Б∙║ п©Б∙╚п©Б∙÷я▐Б■╛п©Б∙ёп©Б∙╙ я▐Б■┌п©Б∙╘я▐Б■░я▐Б■╓п©Б∙÷п©Б∙ё
	'BG_COLOR' => '#FFFFFF',
	// п©Б∙╗п©Б∙╛п©Б∙╘-п©Б∙║п©Б∙╛ п©Б∙╘п©Б∙╕п©Б∙╚п©Б∙╕п©Б∙╖ п©Б∙╚п©Б∙÷ п©Б∙╗п©Б∙÷п©б╘я▐Б■╓п©Б∙ё
	'LINES_COUNT' => 3,
	// я▐Б■▄п©Б∙╛п©Б∙╘я▐Б■╢п©Б∙╕п©Б∙╚п©Б∙÷ п©Б∙╘п©Б∙╕п©Б∙╚п©Б∙╕п©Б∙╖
	'LINES_THICKNESS' => 2
);

/*
	п©б╥п©Б∙═я▐Б■╢п©Б∙╕п©Б∙ё п©б╘п©Б∙÷я▐Б■─п©Б∙╙п©Б∙ёя▐Б■▄я▐Б■─я▐Б√─ п©Б∙╗п©Б∙÷п©б╘я▐Б■╓п©Б∙╕
*/

// я▐Б■°п©Б∙║п©Б∙ёя▐Б■▄п©Б∙÷ я▐Б■┌п©Б∙╕п©Б∙╙п©Б∙║п©Б∙╛п©Б∙╘п©Б∙╛п©Б∙║
define('CODE_CHAR_COLORS', '#880000,#008800,#000088,#888800,#880088,#008888,#000000');
// я▐Б■°п©Б∙║п©Б∙ёя▐Б■▄п©Б∙÷ п©Б∙╘п©Б∙╕п©Б∙╚п©Б∙╕п©Б∙╖
define('CODE_LINE_COLORS', '#880000,#008800,#000088,#888800,#880088,#008888,#000000');

// п©б╘п©Б∙╛п©Б∙╘я▐Б■░я▐Б■╓п©Б∙÷п©Б∙ёп©Б∙╙ я▐Б■°п©Б∙║п©Б∙ёя▐Б■▄п©Б∙÷ п©Б∙╘п©Б∙╕п©Б∙╚п©Б∙╕п©Б∙╖ п©Б∙╕ я▐Б■┌п©Б∙╕п©Б∙╙п©Б∙║п©Б∙╛п©Б∙╘п©Б∙╛п©Б∙║ п©Б∙║ п©Б∙╙п©Б∙÷я▐Б■┌я▐Б■┌п©Б∙╕п©Б∙║я▐Б√─ п©Б∙╒п©Б∙╘я▐Б√░ я▐Б■┌п©Б∙╘я▐Б■░я▐Б■╓п©Б∙÷п©Б∙╖п©Б∙╚п©Б∙╛п©Б∙╖ п©Б∙║я▐Б√─п©Б∙═п©Б∙╛я▐Б■─п©Б∙╗п©Б∙╕ п©б╘п©Б∙╛п©Б∙╔п©Б∙╒п©Б∙╚п©Б∙ёп©Б∙ё
$line_colors = preg_split('/,\s*?/', CODE_LINE_COLORS);
$char_colors = preg_split('/,\s*?/', CODE_CHAR_COLORS);

// я▐Б■┌п©Б∙╛п©Б∙╔п©Б∙╒п©Б∙÷п©Б∙ёп©Б∙╙ п©б╘я▐Б■░я▐Б■┌я▐Б■▄п©Б∙╛п©Б∙╖ я▐Б■─п©Б∙╕я▐Б■┌я▐Б■░п©Б∙╚п©Б∙╛п©Б∙╗ п©Б∙╕ п©Б∙╔п©Б∙÷п©б╘п©Б∙╛п©Б∙╘п©Б∙╚я▐Б√░п©Б∙ёп©Б∙╙ п©Б∙ёп©п│п©Б∙╛ п©Б∙═п©Б∙ёп©Б∙╘я▐Б√─п©Б∙╙ я▐Б■■п©Б∙╛п©Б∙╚п©Б∙╛п©Б∙╙
$img = imagecreatetruecolor($par['WIDTH'], $par['HEIGHT']);
imagefilledrectangle($img, 0, 0, $par['WIDTH'] - 1, $par['HEIGHT'] - 1, gd_color($par['BG_COLOR']));

// я▐Б■░я▐Б■┌я▐Б■▄п©Б∙÷п©Б∙╚п©Б∙÷п©Б∙║п©Б∙╘п©Б∙╕п©Б∙║п©Б∙÷п©Б∙ёп©Б∙╙ я▐Б■▄п©Б∙╛п©Б∙╘я▐Б■╢п©Б∙╕п©Б∙╚я▐Б■░ п©Б∙╘п©Б∙╕п©Б∙╚п©Б∙╕п©Б∙╖ п©Б∙╕ п©Б∙║я▐Б√─п©Б∙║п©Б∙╛п©Б∙╒п©Б∙╕п©Б∙╙ п©Б∙╕я▐Б■≤ п©Б∙╚п©Б∙÷ п©Б∙╗п©Б∙÷п©б╘я▐Б■╓я▐Б■░
imagesetthickness($img, $par['LINES_THICKNESS']);

for ($i = 0; $i < $par['LINES_COUNT']; $i++)
    imageline($img,
        mt_rand(0, $par['WIDTH'] - 1),
        mt_rand(0, $par['HEIGHT'] - 1),
        mt_rand(0, $par['WIDTH'] - 1),
        mt_rand(0, $par['HEIGHT'] - 1),
        gd_color($line_colors[mt_rand(0, count($line_colors) - 1)])
    );

// п©ц╥п©Б∙ёя▐Б■─п©Б∙ёп©Б∙╙п©Б∙ёп©Б∙╚п©Б∙╚п©Б∙÷я▐Б√░ п©Б∙╒п©Б∙╘я▐Б√░ я▐Б■≤я▐Б■─п©Б∙÷п©Б∙╚п©Б∙ёп©Б∙╚п©Б∙╕я▐Б√░ п©Б∙╗п©Б∙╛п©Б∙╒п©Б∙÷ п©Б∙╗п©Б∙÷п©б╘я▐Б■╓п©Б∙╕
$code = '';

// п©Б┴┬п©Б∙÷п©Б∙╒п©Б∙÷п©Б∙╒п©Б∙╕п©Б∙╙ п©Б∙╗п©Б∙╛п©Б∙╛я▐Б■─п©Б∙╒п©Б∙╕п©Б∙╚п©Б∙÷я▐Б■▄я▐Б■░ п©б╘п©Б∙╛ я▐Б■°п©Б∙ёп©Б∙╚я▐Б■▄я▐Б■─я▐Б■░ п©Б∙╛я▐Б■┌п©Б∙╕ Y 
$y = ($par['HEIGHT'] / 2) + ($par['FONT_SIZE'] / 2);

// п©Б√⌠я▐Б√─п©Б∙║п©Б∙╛п©Б∙╒п©Б∙╕п©Б∙╙ я▐Б■┌п©Б∙╕п©Б∙╙п©Б∙║п©Б∙╛п©Б∙╘я▐Б√─ п©Б∙╚п©Б∙÷ п©Б∙╗п©Б∙÷п©б╘я▐Б■╓п©Б∙ё
for ($i = 0; $i < $par['CHARS_COUNT']; $i++) {
		// п©Б∙║я▐Б√─п©Б∙═п©Б∙╕я▐Б■─п©Б∙÷п©Б∙ёп©Б∙╙ я▐Б■┌п©Б∙╘я▐Б■░я▐Б■╓п©Б∙÷п©Б∙╖п©Б∙╚я▐Б√─п©Б∙╖ я▐Б■°п©Б∙║п©Б∙ёя▐Б■▄ п©Б∙╕п©Б∙╔ п©Б∙╒п©Б∙╛я▐Б■┌я▐Б■▄я▐Б■░п©б╘п©Б∙╚п©Б∙╛п©п│п©Б∙╛ п©Б∙╚п©Б∙÷п©Б∙═п©Б∙╛я▐Б■─п©Б∙÷
    $color = gd_color($char_colors[mt_rand(0, count($char_colors) - 1)]);
    // п©Б∙╛п©б╘я▐Б■─п©Б∙ёп©Б∙╒п©Б∙ёп©Б∙╘я▐Б√░п©Б∙ёп©Б∙╙ я▐Б■┌п©Б∙╘я▐Б■░я▐Б■╓п©Б∙÷п©Б∙╖п©Б∙╚я▐Б√─п©Б∙╖ я▐Б■░п©п│п©Б∙╛п©Б∙╘ п©Б∙╚п©Б∙÷п©Б∙╗п©Б∙╛п©Б∙╘п©Б∙╚п©Б∙÷ я▐Б■┌п©Б∙╕п©Б∙╙п©Б∙║п©Б∙╛п©Б∙╘п©Б∙÷ п©Б∙╛я▐Б■▄ -45 п©Б∙╒п©Б∙╛ 45 п©п│я▐Б■─п©Б∙÷п©Б∙╒я▐Б■░я▐Б■┌п©Б∙╛п©Б∙║
    $angle = mt_rand(-45, 45);
    // п©Б∙║я▐Б√─п©Б∙═п©Б∙╕я▐Б■─п©Б∙÷п©Б∙ёп©Б∙╙ я▐Б■┌п©Б∙╘я▐Б■░я▐Б■╓п©Б∙÷п©Б∙╖п©Б∙╚я▐Б√─п©Б∙╖ я▐Б■┌п©Б∙╕п©Б∙╙п©Б∙║п©Б∙╛п©Б∙╘ п©Б∙╕п©Б∙╔ п©Б∙╒п©Б∙╛я▐Б■┌я▐Б■▄я▐Б■░п©б╘п©Б∙╚п©Б∙╛п©п│п©Б∙╛ п©Б∙╚п©Б∙÷п©Б∙═п©Б∙╛я▐Б■─п©Б∙÷
    $char = substr($par['ALLOWED_CHARS'], mt_rand(0, strlen($par['ALLOWED_CHARS']) - 1), 1);
    // п©Б∙║я▐Б√─п©Б∙═п©Б∙╕я▐Б■─п©Б∙÷п©Б∙ёп©Б∙╙ я▐Б■┌п©Б∙╘я▐Б■░я▐Б■╓п©Б∙÷п©Б∙╖п©Б∙╚я▐Б√─п©Б∙╖ я▐Б■╛я▐Б■─п©Б∙╕я▐Б■■я▐Б■▄ п©Б∙╕п©Б∙╔ п©Б∙╒п©Б∙╛я▐Б■┌я▐Б■▄я▐Б■░п©б╘п©Б∙╚п©Б∙╛п©п│п©Б∙╛ п©Б∙╚п©Б∙÷п©Б∙═п©Б∙╛я▐Б■─п©Б∙÷
    $font = PATH_TTF . $fonts[mt_rand(0, count($fonts) - 1)];
    // п©Б∙║я▐Б√─я▐Б■╓п©Б∙╕я▐Б■┌п©Б∙╘п©Б∙╕п©Б∙╙ п©Б∙╗п©Б∙╛п©Б∙╛я▐Б■─п©Б∙╒п©Б∙╕п©Б∙╚п©Б∙÷я▐Б■▄я▐Б■░ я▐Б■▄п©Б∙ёп©Б∙╗я▐Б■░я▐Б■╢п©Б∙ёп©п│п©Б∙╛ я▐Б■┌п©Б∙╕п©Б∙╙п©Б∙║п©Б∙╛п©Б∙╘п©Б∙÷ п©б╘п©Б∙╛ п©Б∙╛я▐Б■┌п©Б∙╕ X
    $x = (intval(($par['WIDTH'] / $par['CHARS_COUNT']) * $i) + ($par['FONT_SIZE'] / 2));
    
    // п©Б∙║я▐Б√─п©Б∙║п©Б∙╛п©Б∙╒п©Б∙╕п©Б∙╙ я▐Б■┌п©Б∙╕п©Б∙╙п©Б∙║п©Б∙╛п©Б∙╘ п©Б∙╚п©Б∙÷ п©Б∙╗п©Б∙÷п©б╘я▐Б■╓я▐Б■░
    imagettftext($img, $par['FONT_SIZE'], $angle, $x, $y, $color, $font, $char);
    
    // я▐Б■┌п©Б∙╛я▐Б■≤я▐Б■─п©Б∙÷п©Б∙╚я▐Б√░п©Б∙ёп©Б∙╙ п©Б∙╗п©Б∙╛п©Б∙╒ п©Б∙╗п©Б∙÷п©б╘я▐Б■╓п©Б∙╕
    $code .= $char;
}

// я▐Б■┌п©Б∙╛я▐Б■≤я▐Б■─п©Б∙÷п©Б∙╚п©Б∙╕п©Б∙╙ п©Б∙╗п©Б∙÷п©б╘я▐Б■╓я▐Б■░ п©Б∙║ п©Б∙╗я▐Б■░п©Б∙╗п©Б∙÷я▐Б■≤ п©Б∙╒п©Б∙╘я▐Б√░ п©Б∙╒п©Б∙÷п©Б∙╘я▐Б√└п©Б∙╚п©Б∙ёп©Б∙╖я▐Б■╛п©Б∙ёп©Б∙╖ п©б╘я▐Б■─п©Б∙╛п©Б∙║п©Б∙ёя▐Б■─п©Б∙╗п©Б∙╕
setcookie(CAPTCHA_COOKIE, md5($code));

/*

	п©ц╥п©Б∙╛я▐Б■┌я▐Б√─п©Б∙╘п©Б∙÷п©Б∙ёп©Б∙╙ я▐Б■┌я▐Б■■п©Б∙╛я▐Б■─п©Б∙╙п©Б∙╕я▐Б■─п©Б∙╛п©Б∙║п©Б∙÷п©Б∙╚п©Б∙╚я▐Б√─п©Б∙╖ я▐Б■─п©Б∙╕я▐Б■┌я▐Б■░п©Б∙╚п©Б∙╛п©Б∙╗ п©Б∙║ п©Б∙═я▐Б■─п©Б∙÷я▐Б■░п©Б∙╔п©Б∙ёя▐Б■─ п©Б∙╕ п©Б∙╕п©Б∙╔п©Б∙═п©Б∙÷п©Б∙║п©Б∙╘я▐Б√░п©Б∙ёп©Б∙╙я▐Б■┌я▐Б√░ п©Б∙╛я▐Б■▄ п©Б∙╚п©Б∙ёп©п│п©Б∙╛, 
	я▐Б■≤п©Б∙╛я▐Б■▄я▐Б√░ я▐Б■┌п©Б∙═п©Б∙╛я▐Б■─я▐Б■╢п©Б∙╕п©Б∙╗ п©Б∙╙я▐Б■░я▐Б■┌п©Б∙╛я▐Б■─п©Б∙÷ п©Б∙╛п©Б∙═я▐Б√─я▐Б■╓п©Б∙╚п©Б∙╛ я▐Б√┬я▐Б■▄п©Б∙╛ п©Б∙╒п©Б∙ёп©Б∙╘п©Б∙÷п©Б∙ёя▐Б■▄ п©Б∙╔п©Б∙÷ п©Б∙╚п©Б∙÷я▐Б■┌
	
*/

header("Content-Type: image/png");
imagepng($img);
imagedestroy($img);

// п©ц╥я▐Б■─п©Б∙ёп©Б∙╛п©Б∙═я▐Б■─п©Б∙÷п©Б∙╔я▐Б■░п©Б∙ёп©Б∙╙ HTML 6-я▐Б■┌п©Б∙╕п©Б∙╙п©Б∙║п©Б∙╛п©Б∙╘я▐Б√└п©Б∙╚я▐Б√─п©Б∙╖ я▐Б■°п©Б∙║п©Б∙ёя▐Б■▄ п©Б∙║ GD я▐Б■°п©Б∙║п©Б∙ёя▐Б■▄ 
function gd_color($html_color)
{
  return preg_match('/^#?([\dA-F]{6})$/i', $html_color, $rgb)
    ? hexdec($rgb[1]) : false;
}
